In [1]:
import pandas as pd
import re
import numpy as np

In [2]:
data_express = pd.read_excel('./Datas/Express.xlsx')
data_standard = pd.read_excel('./Datas/Standart.xlsx')
data_shipments = pd.read_csv('./Datas/Shipments2.csv')
pd.set_option('display.max_columns', None)
pd.set_option('display.max_rows', None)

In [3]:
data_shipments.dtypes

to_postcode      object
to_country_id     int64
dtype: object

In [4]:
data_shipments = data_shipments.rename(columns = {'to_postcode' : 'CEP'})

In [5]:
data_shipments.head()

         CEP  to_country_id
0   00000000             32
1  00005-820             32
2  01031-970             32
3   01033001             64
4  01033-001             32

In [6]:
data_shipments['CEP'] =  data_shipments['CEP'].replace(to_replace=r'\D+', value='', regex=True)

In [7]:
data_shipments.head()

        CEP  to_country_id
0  00000000             32
1  00005820             32
2  01031970             32
3  01033001             64
4  01033001             32

In [8]:
data_shipments['CEP'].fillna(0, inplace= True)

In [9]:
data_shipments['CEP'].head()

0    00000000
1    00005820
2    01031970
3    01033001
4    01033001
Name: CEP, dtype: object

In [10]:
#Filtrando apenas pelo Country_id 32 (Brasil)
data_shipments = data_shipments.loc[data_shipments['to_country_id'] == 32]

In [11]:
data_shipments['CEP'].head()

0    00000000
1    00005820
2    01031970
4    01033001
7    01041000
Name: CEP, dtype: object

In [12]:
data_shipments.dtypes

CEP              object
to_country_id     int64
dtype: object

In [13]:
data_shipments.head()

        CEP  to_country_id
0  00000000             32
1  00005820             32
2  01031970             32
4  01033001             32
7  01041000             32

In [14]:
data_shipments.dtypes

CEP              object
to_country_id     int64
dtype: object

In [15]:
data_shipments['CEP'] = data_shipments['CEP'].str.strip()

In [16]:
data_shipments['CEP'] = data_shipments['CEP'].replace('', np.nan)

In [17]:
data_shipments.head()

        CEP  to_country_id
0  00000000             32
1  00005820             32
2  01031970             32
4  01033001             32
7  01041000             32

In [18]:
data_shipments = data_shipments.reset_index(drop = True)

In [19]:
valor_padrao = 1
data_shipments['CEP'] = data_shipments['CEP'].fillna(valor_padrao)
data_shipments.head()

        CEP  to_country_id
0  00000000             32
1  00005820             32
2  01031970             32
3  01033001             32
4  01041000             32

In [20]:
data_shipments.dtypes

CEP              object
to_country_id     int64
dtype: object

# Verificando DF Express | Standart

In [21]:
data_express.head()

    CEP INI   CEP FIN    NOME COBERTURA  UF FRANQUIA  EXPRESSO
0  16800000  16849999      MIRANDOPOLIS  SP      AAN  ATENDIDO
1  16900001  16905265         ANDRADINA  SP      AAN  ATENDIDO
2  16920000  16939999          CASTILHO  SP      AAN  ATENDIDO
3  16950000  16979999  MURUTINGA DO SUL  SP      AAN  ATENDIDO
4  16980000  16999999          GUARACAI  SP      AAN  ATENDIDO

In [22]:
data_express.dtypes

CEP INI            int64
CEP FIN            int64
NOME COBERTURA    object
UF                object
FRANQUIA          object
EXPRESSO          object
dtype: object

In [23]:
data_express = data_express.rename(columns = {'CEP INI' : 'CEP_INI'})
data_express = data_express.rename(columns = {'CEP FIN' : 'CEP_FIN'})

In [24]:
data_express.head()

    CEP_INI   CEP_FIN    NOME COBERTURA  UF FRANQUIA  EXPRESSO
0  16800000  16849999      MIRANDOPOLIS  SP      AAN  ATENDIDO
1  16900001  16905265         ANDRADINA  SP      AAN  ATENDIDO
2  16920000  16939999          CASTILHO  SP      AAN  ATENDIDO
3  16950000  16979999  MURUTINGA DO SUL  SP      AAN  ATENDIDO
4  16980000  16999999          GUARACAI  SP      AAN  ATENDIDO

In [25]:
data_standard = data_standard.rename(columns = {'CEP INI' : 'CEP_INI'})
data_standard = data_standard.rename(columns = {'CEP FIN' : 'CEP_FIN'})

In [26]:
data_express.head()

    CEP_INI   CEP_FIN    NOME COBERTURA  UF FRANQUIA  EXPRESSO
0  16800000  16849999      MIRANDOPOLIS  SP      AAN  ATENDIDO
1  16900001  16905265         ANDRADINA  SP      AAN  ATENDIDO
2  16920000  16939999          CASTILHO  SP      AAN  ATENDIDO
3  16950000  16979999  MURUTINGA DO SUL  SP      AAN  ATENDIDO
4  16980000  16999999          GUARACAI  SP      AAN  ATENDIDO

In [27]:
data_express.dtypes

CEP_INI            int64
CEP_FIN            int64
NOME COBERTURA    object
UF                object
FRANQUIA          object
EXPRESSO          object
dtype: object

# Range

### Express

In [29]:
data_express['CEP_RANGE'] = [list(range(cep_ini, cep_fin + 1)) for cep_ini, cep_fin in zip(data_express['CEP_INI'], data_express['CEP_FIN'])]

In [30]:
lista_cep_express = data_express['CEP_RANGE'].explode().tolist()

In [31]:
lista_cep_shipments = data_shipments['CEP'].explode().tolist()

In [32]:
lista_cep_express_str = list(map(str, lista_cep_express))

In [50]:
shipments = set(lista_cep_shipments)
express = set(lista_cep_express_str)

In [53]:
len(express)

51801245

In [54]:
len(lista_cep_express_str)

51801245

In [46]:
valor_comum = 0

In [55]:
for valor in shipments:
    if valor in express:
        valor_comum += 1

In [59]:
porcentagem = round((valor_comum / len(shipments)) * 100,2)

In [60]:
porcentagem

95.05

In [61]:
print(f'A estimativa de CEPS Shipments dentro do CEPS Express é de {porcentagem}%')

A estimativa de CEPS Shipments dentro do CEPS Express é de 95.05%